```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

digitalocean_kubernetes_cluster.main: Refreshing state... [id=63027d19-b3f6-48f9-92e9-00146923149d]
kubernetes_service_account.tiller: Refreshing state... [id=kube-system/tiller]
kubernetes_namespace.monitoring: Refreshing state... [id=monitoring]
kubernetes_namespace.data: Refreshing state... [id=data]
kubernetes_cluster_role_binding.tiller: Refreshing state... [id=tiller-cluster-admin]
helm_release.traefik: Refreshing state... [id=traefik]
helm_release.grafana: Refreshing state... [id=grafana]
helm_release.mongodb: Refreshing state... [id=mongodb]
data.helm_repository.loki_repo: Refreshing state...
helm_release.prometheus: Refreshing state... [id=prometheus]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.main must be replaced
-/+ resource "digitalocean_kubernetes_cluster" "main" {
      ~ cluster_subnet = "10.244.0.0/16" -> (known after apply)
      ~ created_at     = "2019-07-06 10:15:58 +0000 UTC" -> (known after apply)
      ~ endpoint       = "https://63027d19-b3f6-48f9-92e9-00146923149d.k8s.ondigitalocean.com" -> (known after apply)
      ~ id             = "63027d19-b3f6-48f9-92e9-00146923149d" -> (known after apply)
      ~ ipv4_address   = "174.138.4.131" -> (known after apply)
      ~ kube_config    = [
          - {
              - client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURyVENDQXBXZ0F3SUJBZ0lDQm5Vd0RRWUpLb1pJaHZjTkFRRUxCUUF3TXpFVk1CTUdBMVVFQ2hNTVJHbG4KYVhSaGJFOWpaV0Z1TVJvd0dBWURWUVFERXhGck9ITmhZWE1nUTJ4MWMzUmxjaUJEUVRBZUZ3MHhPVEEzTURZeApNRE0wTWpCYUZ3MHhPVEEzTVRNeE1ETTBNakJhTUg4eEN6QUpCZ05WQkFZVEFsVlRNUXN3Q1FZRFZRUUlFd0pPCldURVJNQThHQTFVRUJ4TUlUbVYzSUZsdmNtc3hIVEFiQmdOVkJBb1RGR3M0YzJGaGN6cGhkWFJvWlc1MGFXTmgKZEdWa01URXdMd1lEVlFRREV5aG1NbVJtTVRGaU9URTFaREkyWVdabE5XTTRaamM1WkdRMk1EQTJNR1k0TlRaaQpOMlJqWmpsa01JSUJJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBUThBTUlJQkNnS0NBUUVBeHRBS1dneWQyK0w4CmpFSlI4ZnFPZm9vN3JCM0RKR3EzVUZ2SmMwY2JFdVB0OWpoN0pNM2QvWkhGVHo4WlFET1poNTBITHBsYURNdVEKKzV1cTRrSWY3VE9RbGtZUk5kWHQ1UVlxQzVlRkF4Z1NxeFdCRXlLbEZpVjVFT1FtTVdVL3JUcEF0dkR0VXJwcgpSZ3JRdWxWZ2dxWnpKeDBhUmg4OW4zMTJwTksweHpUWmhwV2xGa2xGcVVMZzZhNGEvYmtVQzlOOTFwaE1HcWJXCkpmQU1xWCt4Vk81Q0E1cEdQV2hyL0VyUThIejZBTVRYb3RlZUV6U1pzKzkybU5nSWdST2IvY091cTJBMStWQUgKZVlKd3ozWHRRak9mS2pBTFJscWQyWExCSkkvMXFOQUFmcDZNOU1IajBCeWVKbk9FdG91WEVXN1lFcWVBaWVMVwpOekRHUXdhbnR3SURBUUFCbzM4d2ZUQU9CZ05WSFE4QkFmOEVCQU1DQmFBd0hRWURWUjBsQkJZd0ZBWUlLd1lCCkJRVUhBd0lHQ0NzR0FRVUZCd01CTUF3R0ExVWRFd0VCL3dRQ01BQXdIUVlEVlIwT0JCWUVGSGJ2aGhuckpvbjUKUVluVGFxNEVSRXZaN09na01COEdBMVVkSXdRWU1CYUFGQ2d2SDY4ZVgvdjhpdHpqRFkzT1ZUczMzNWpETUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQkFRQTJ6S2VJdnlaVlB6c0VVWU14NXVWbzB3USt4ZjBPdVpQN3VuU3JGVTdNCnBHbkNlZDFqb0V6NFdZNVppYlhCUEx4MlJERGRUMkpZcFRRYnl0dE9mSTZPeG5LVEMvSkRtVXhYZ0lpei9WMFcKMzVySmQvN3l5MzNrTG1KR3hmZ2hNUFFudDFva0JiWDV2U0NIOTZWOUJjVmtkYW9XUDZXNDc4ZHM5LzREZ2ZjTApzaUdQdVVtd1FoNEVYcERzSGhaeXRlNEpMSXVkdzU2Nm9qZWc5ZG0rdmVxclc0TE1KWC9ZL0N5T1ZaUXBQWHc1CjlwMmZlOGtvVGZ3V0hjVlUvWFJmNVFWUkUvaEpiVWU3L3dCTTlwaXZtNlBrMEgwYTcwcU81aXgzdkVod1lSc1gKTmJ4TTA0SlBKWmdheTlRTWxySUpaQlFaZjlzaVMvQksydlJhTEJVQkhmYjMKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
              - client_key             = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlFcEFJQkFBS0NBUUVBeHRBS1dneWQyK0w4akVKUjhmcU9mb283ckIzREpHcTNVRnZKYzBjYkV1UHQ5amg3CkpNM2QvWkhGVHo4WlFET1poNTBITHBsYURNdVErNXVxNGtJZjdUT1Fsa1lSTmRYdDVRWXFDNWVGQXhnU3F4V0IKRXlLbEZpVjVFT1FtTVdVL3JUcEF0dkR0VXJwclJnclF1bFZnZ3Faekp4MGFSaDg5bjMxMnBOSzB4elRaaHBXbApGa2xGcVVMZzZhNGEvYmtVQzlOOTFwaE1HcWJXSmZBTXFYK3hWTzVDQTVwR1BXaHIvRXJROEh6NkFNVFhvdGVlCkV6U1pzKzkybU5nSWdST2IvY091cTJBMStWQUhlWUp3ejNYdFFqT2ZLakFMUmxxZDJYTEJKSS8xcU5BQWZwNk0KOU1IajBCeWVKbk9FdG91WEVXN1lFcWVBaWVMV056REdRd2FudHdJREFRQUJBb0lCQVFDTkxXcE1hNjBsV2RoUQptVCtyZjJyMGZLREhKaE5PcHVFcGxTUkdVZlh0d2lGV3VPRHBUNjhWd3cvRHFHRDc4Q2hUM3JRYzZSVERCVU1kCkNIdWVVNnBzUERPdUltOVNOV25MT2tkZEYrbUNPdlAydlR4OUpCcnEwUTFaYTBtYnhmUWp4THZ6ckw0NkF0cnUKVC92TWRaZ2s3cUhTNHAybnNjT0dvQWRDSDhYenRsaWZOcXJtQjl5WjlKSXdmekFPSGR2Rnk3bUZVVmQra1J6bQpvUk0rQ0xMRGlTMWM1c0s0bkxZTmV3ZUtDWGVtWmpVMzhMTnVoNGMrRkhWUWJ2Q1FScGdOZ0hBWnk5Mm5maC81CjRHdDdCQytqMWptaENNNmJ0eHdteXM0WndSRnNuNW5TQjJla3JZQlE1UWpVeWZvdUR0VkdXOHhoYXBqOWRlcTgKZi81YUQyOUJBb0dCQU5LWG94YUNHYnM3Ri84a2xaM09nVWdrVzNqcDVhY0xWbmg0aTVseTVidnJYYVo5VkxoSwpDZGpweTJrVHdpLzQ2Nzg0QTJIS0RXcUJQbk9ZS1VMd1NSaytQQlRWUVpwZ1AzMkFEV2crTGhvZU5PalJNZ3ljCkpMZk5FcmxLZFJvbGVxRVRuc29mbUZXS3Z6UzgwdU1xK1ZMNXJYTUxFYmVwSzVuUGlxbi90TVpuQW9HQkFQR3UKTHh3cTdYdVJabExaNUhWbzkzaEZTMnYrajFpOXVMV21HUzA4YVNEaENJaGtXa01MQ1k5cktubzloSUlhRkNlcQpPTDF6WDE4aWhVQURkdm53TS9YNEZranpQYzBDcGxTME11cWFEOUo2K2NPeVk5eXdSaWp6V2hMbENNT2JucWNzCmFnL1lOQm5aSDBPcW9lYmpuT1c1WUYyMDd6b05kMGdZOHdJT2RTSXhBb0dBRHFqRGo0T0s2ditZRWdpbjZZNUEKYlpjcVR1WnBPQkdQK1Y3YXlObTRxRFlnRk1EUXJ1dG9lQkwrTjloS1FqQ2ZxSFhydGxqc1NpZXBBejdxVUdDTgpsaFpBOUdwTDRNVW1aa1FOcXQzNU01UTZ0cUlwUzd0cXl1aVpqeEJoeW1vbGVTVDJmcmRvVVR3UlIwaUZuWTZXClFISms0b2M0dW9JcUtORExwRDNLaGEwQ2dZRUF0U1NxR01Hd0tEcnQ1OUY3SStsZCt0NXRUbStKUDZsTDVaS3UKTWpLaVZVdDEyc3prdm5WcVgvMmg0K2R5QnhYRzM0ZjlhVG90VktBS0lkVzIrbFRvalVhNlpVa3puQktOV3RXSgppRCthOWxiSUY3OEFqR3Z1MmtpenpZK3ZSdlhBTDJyaHdDaDd2SmY1ai8wM3hsZjV4RkZ5Z2luWVdMbTVHdWZnClZEMUQzREVDZ1lCZ2Jod2JscWI1aXM2ZDYvL2M5Z3RZZlZPVGZxam5WV1JtRUd4djVKVkdCbDZNNU13bjNSNXcKaWdWajBORW0xQmx1SFc3Y0xtYTE4NG44V2VuWkdZTmVnaDhCc0ZCY0ZzWWp1Uk5mSndBMmpFUDVnemZLdk9PSgpNQStXenRvK1lWUnE5VVluVFBTalU3L3NRbjhiaHIyVWJPTWYydE9GbnhQbGQyNUZJdHBsR0E9PQotLS0tLUVORCBSU0EgUFJJVkFURSBLRVktLS0tLQo="
              - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURKekNDQWcrZ0F3SUJBZ0lDQm5Vd0RRWUpLb1pJaHZjTkFRRUxCUUF3TXpFVk1CTUdBMVVFQ2hNTVJHbG4KYVhSaGJFOWpaV0Z1TVJvd0dBWURWUVFERXhGck9ITmhZWE1nUTJ4MWMzUmxjaUJEUVRBZUZ3MHhPVEEzTURZeApNREUyTXpsYUZ3MHpPVEEzTURZeE1ERTJNemxhTURNeEZUQVRCZ05WQkFvVERFUnBaMmwwWVd4UFkyVmhiakVhCk1CZ0dBMVVFQXhNUmF6aHpZV0Z6SUVOc2RYTjBaWElnUTBFd2dnRWlNQTBHQ1NxR1NJYjNEUUVCQVFVQUE0SUIKRHdBd2dnRUtBb0lCQVFDdUp5ZUM2ekExNEkxd0Vzb2pjUnhJYUdmWG9ocEdMTjYxOUsrdTlCUkNyWTFLeXFIcQpwTk83KzVoUWVQcUQxQUhTcDZMaFd4WGRBV0swT1UxT0lkRnZOaEY0RFBUWFdIMGQrUFcyWXpYSTE1MWVEckhmCkhDUXByMUJqM1k1enMvM05WMEhWcEl1ZXhBN2FRZG9xSTFtSHdHdURuMkpvZjhPT3BuTHZNNGVhV2p2L2NtdUcKNHNzckRReEVNczJTcE9yTWxEMHI0KzFxbDIxUlhhYjU1NG94RStkQWRYRlI0S281VHdQNlI3S0VlTmhEL2daSwp4dHBoQnU0L3g1RmEzWlZOS0lOcDdoYlEvSmVtcFhOQmxwVlpkTkpmWmpRRVdiTm4xcjZFYjhycGF5VWszQnczCnd4SEVZdDgrcE5Gc0NHM0xiUnpPNzBGSDJxRlR6RmpTZXQydkFnTUJBQUdqUlRCRE1BNEdBMVVkRHdFQi93UUUKQXdJQmhqQVNCZ05WSFJNQkFmOEVDREFHQVFIL0FnRUFNQjBHQTFVZERnUVdCQlFvTHgrdkhsLzcvSXJjNHcyTgp6bFU3TjkrWXd6QU5CZ2txaGtpRzl3MEJBUXNGQUFPQ0FRRUFyTmJ4bHJMbjRqZDVBUjhXbzkva0JHcC9JeHJCClNqRDlYZDFMZXFMR2dwZ29reENUazFYeHBZdEowcHYrSFZNRkxka0d5WlZ1djFWRTc2eGhYNjd0MU5DRDlkd2gKeHdSRVE3dkhYYlU0dkJwMjV6RDMrZ005bDBpU2hxOFdHNkw0Nmo3R2pKMHlxTFExYjIvaG51NW80RGd4UHAyRQpJTFdiTFQvVDhWTXJSajhuQVMrMmlMS3RoTmcwVUlTQkFJN1JMdE11dFViSCswRVFsdmUxWDhZU1ZGYkQ3QlB2CjV4djdGTFBpNHFUMngwN01rMk16VXFzRStyRHlQd1M2ck9CdnE2OHZYbUlUbUd0S0ZkWUZ1U0FqaFRiSTJWNzIKeEwyYVZDUVgweUk0eVh6dGdrTjNrLzFaeWRPeWVMV25GMzNlM1djakVndHpJWGNsVWhyVk5BVjgvUT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
              - host                   = "https://63027d19-b3f6-48f9-92e9-00146923149d.k8s.ondigitalocean.com"
              - raw_config             = "apiVersion: v1\nclusters:\n- cluster:\n    certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURKekNDQWcrZ0F3SUJBZ0lDQm5Vd0RRWUpLb1pJaHZjTkFRRUxCUUF3TXpFVk1CTUdBMVVFQ2hNTVJHbG4KYVhSaGJFOWpaV0Z1TVJvd0dBWURWUVFERXhGck9ITmhZWE1nUTJ4MWMzUmxjaUJEUVRBZUZ3MHhPVEEzTURZeApNREUyTXpsYUZ3MHpPVEEzTURZeE1ERTJNemxhTURNeEZUQVRCZ05WQkFvVERFUnBaMmwwWVd4UFkyVmhiakVhCk1CZ0dBMVVFQXhNUmF6aHpZV0Z6SUVOc2RYTjBaWElnUTBFd2dnRWlNQTBHQ1NxR1NJYjNEUUVCQVFVQUE0SUIKRHdBd2dnRUtBb0lCQVFDdUp5ZUM2ekExNEkxd0Vzb2pjUnhJYUdmWG9ocEdMTjYxOUsrdTlCUkNyWTFLeXFIcQpwTk83KzVoUWVQcUQxQUhTcDZMaFd4WGRBV0swT1UxT0lkRnZOaEY0RFBUWFdIMGQrUFcyWXpYSTE1MWVEckhmCkhDUXByMUJqM1k1enMvM05WMEhWcEl1ZXhBN2FRZG9xSTFtSHdHdURuMkpvZjhPT3BuTHZNNGVhV2p2L2NtdUcKNHNzckRReEVNczJTcE9yTWxEMHI0KzFxbDIxUlhhYjU1NG94RStkQWRYRlI0S281VHdQNlI3S0VlTmhEL2daSwp4dHBoQnU0L3g1RmEzWlZOS0lOcDdoYlEvSmVtcFhOQmxwVlpkTkpmWmpRRVdiTm4xcjZFYjhycGF5VWszQnczCnd4SEVZdDgrcE5Gc0NHM0xiUnpPNzBGSDJxRlR6RmpTZXQydkFnTUJBQUdqUlRCRE1BNEdBMVVkRHdFQi93UUUKQXdJQmhqQVNCZ05WSFJNQkFmOEVDREFHQVFIL0FnRUFNQjBHQTFVZERnUVdCQlFvTHgrdkhsLzcvSXJjNHcyTgp6bFU3TjkrWXd6QU5CZ2txaGtpRzl3MEJBUXNGQUFPQ0FRRUFyTmJ4bHJMbjRqZDVBUjhXbzkva0JHcC9JeHJCClNqRDlYZDFMZXFMR2dwZ29reENUazFYeHBZdEowcHYrSFZNRkxka0d5WlZ1djFWRTc2eGhYNjd0MU5DRDlkd2gKeHdSRVE3dkhYYlU0dkJwMjV6RDMrZ005bDBpU2hxOFdHNkw0Nmo3R2pKMHlxTFExYjIvaG51NW80RGd4UHAyRQpJTFdiTFQvVDhWTXJSajhuQVMrMmlMS3RoTmcwVUlTQkFJN1JMdE11dFViSCswRVFsdmUxWDhZU1ZGYkQ3QlB2CjV4djdGTFBpNHFUMngwN01rMk16VXFzRStyRHlQd1M2ck9CdnE2OHZYbUlUbUd0S0ZkWUZ1U0FqaFRiSTJWNzIKeEwyYVZDUVgweUk0eVh6dGdrTjNrLzFaeWRPeWVMV25GMzNlM1djakVndHpJWGNsVWhyVk5BVjgvUT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K\n    server: https://63027d19-b3f6-48f9-92e9-00146923149d.k8s.ondigitalocean.com\n  name: do-ams3-main\ncontexts:\n- context:\n    cluster: do-ams3-main\n    user: do-ams3-main-admin\n  name: do-ams3-main\ncurrent-context: do-ams3-main\nkind: Config\npreferences: {}\nusers:\n- name: do-ams3-main-admin\n  user:\n    client-certificate-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURyVENDQXBXZ0F3SUJBZ0lDQm5Vd0RRWUpLb1pJaHZjTkFRRUxCUUF3TXpFVk1CTUdBMVVFQ2hNTVJHbG4KYVhSaGJFOWpaV0Z1TVJvd0dBWURWUVFERXhGck9ITmhZWE1nUTJ4MWMzUmxjaUJEUVRBZUZ3MHhPVEEzTURZeApNRE0wTWpCYUZ3MHhPVEEzTVRNeE1ETTBNakJhTUg4eEN6QUpCZ05WQkFZVEFsVlRNUXN3Q1FZRFZRUUlFd0pPCldURVJNQThHQTFVRUJ4TUlUbVYzSUZsdmNtc3hIVEFiQmdOVkJBb1RGR3M0YzJGaGN6cGhkWFJvWlc1MGFXTmgKZEdWa01URXdMd1lEVlFRREV5aG1NbVJtTVRGaU9URTFaREkyWVdabE5XTTRaamM1WkdRMk1EQTJNR1k0TlRaaQpOMlJqWmpsa01JSUJJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBUThBTUlJQkNnS0NBUUVBeHRBS1dneWQyK0w4CmpFSlI4ZnFPZm9vN3JCM0RKR3EzVUZ2SmMwY2JFdVB0OWpoN0pNM2QvWkhGVHo4WlFET1poNTBITHBsYURNdVEKKzV1cTRrSWY3VE9RbGtZUk5kWHQ1UVlxQzVlRkF4Z1NxeFdCRXlLbEZpVjVFT1FtTVdVL3JUcEF0dkR0VXJwcgpSZ3JRdWxWZ2dxWnpKeDBhUmg4OW4zMTJwTksweHpUWmhwV2xGa2xGcVVMZzZhNGEvYmtVQzlOOTFwaE1HcWJXCkpmQU1xWCt4Vk81Q0E1cEdQV2hyL0VyUThIejZBTVRYb3RlZUV6U1pzKzkybU5nSWdST2IvY091cTJBMStWQUgKZVlKd3ozWHRRak9mS2pBTFJscWQyWExCSkkvMXFOQUFmcDZNOU1IajBCeWVKbk9FdG91WEVXN1lFcWVBaWVMVwpOekRHUXdhbnR3SURBUUFCbzM4d2ZUQU9CZ05WSFE4QkFmOEVCQU1DQmFBd0hRWURWUjBsQkJZd0ZBWUlLd1lCCkJRVUhBd0lHQ0NzR0FRVUZCd01CTUF3R0ExVWRFd0VCL3dRQ01BQXdIUVlEVlIwT0JCWUVGSGJ2aGhuckpvbjUKUVluVGFxNEVSRXZaN09na01COEdBMVVkSXdRWU1CYUFGQ2d2SDY4ZVgvdjhpdHpqRFkzT1ZUczMzNWpETUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQkFRQTJ6S2VJdnlaVlB6c0VVWU14NXVWbzB3USt4ZjBPdVpQN3VuU3JGVTdNCnBHbkNlZDFqb0V6NFdZNVppYlhCUEx4MlJERGRUMkpZcFRRYnl0dE9mSTZPeG5LVEMvSkRtVXhYZ0lpei9WMFcKMzVySmQvN3l5MzNrTG1KR3hmZ2hNUFFudDFva0JiWDV2U0NIOTZWOUJjVmtkYW9XUDZXNDc4ZHM5LzREZ2ZjTApzaUdQdVVtd1FoNEVYcERzSGhaeXRlNEpMSXVkdzU2Nm9qZWc5ZG0rdmVxclc0TE1KWC9ZL0N5T1ZaUXBQWHc1CjlwMmZlOGtvVGZ3V0hjVlUvWFJmNVFWUkUvaEpiVWU3L3dCTTlwaXZtNlBrMEgwYTcwcU81aXgzdkVod1lSc1gKTmJ4TTA0SlBKWmdheTlRTWxySUpaQlFaZjlzaVMvQksydlJhTEJVQkhmYjMKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=\n    client-key-data: LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlFcEFJQkFBS0NBUUVBeHRBS1dneWQyK0w4akVKUjhmcU9mb283ckIzREpHcTNVRnZKYzBjYkV1UHQ5amg3CkpNM2QvWkhGVHo4WlFET1poNTBITHBsYURNdVErNXVxNGtJZjdUT1Fsa1lSTmRYdDVRWXFDNWVGQXhnU3F4V0IKRXlLbEZpVjVFT1FtTVdVL3JUcEF0dkR0VXJwclJnclF1bFZnZ3Faekp4MGFSaDg5bjMxMnBOSzB4elRaaHBXbApGa2xGcVVMZzZhNGEvYmtVQzlOOTFwaE1HcWJXSmZBTXFYK3hWTzVDQTVwR1BXaHIvRXJROEh6NkFNVFhvdGVlCkV6U1pzKzkybU5nSWdST2IvY091cTJBMStWQUhlWUp3ejNYdFFqT2ZLakFMUmxxZDJYTEJKSS8xcU5BQWZwNk0KOU1IajBCeWVKbk9FdG91WEVXN1lFcWVBaWVMV056REdRd2FudHdJREFRQUJBb0lCQVFDTkxXcE1hNjBsV2RoUQptVCtyZjJyMGZLREhKaE5PcHVFcGxTUkdVZlh0d2lGV3VPRHBUNjhWd3cvRHFHRDc4Q2hUM3JRYzZSVERCVU1kCkNIdWVVNnBzUERPdUltOVNOV25MT2tkZEYrbUNPdlAydlR4OUpCcnEwUTFaYTBtYnhmUWp4THZ6ckw0NkF0cnUKVC92TWRaZ2s3cUhTNHAybnNjT0dvQWRDSDhYenRsaWZOcXJtQjl5WjlKSXdmekFPSGR2Rnk3bUZVVmQra1J6bQpvUk0rQ0xMRGlTMWM1c0s0bkxZTmV3ZUtDWGVtWmpVMzhMTnVoNGMrRkhWUWJ2Q1FScGdOZ0hBWnk5Mm5maC81CjRHdDdCQytqMWptaENNNmJ0eHdteXM0WndSRnNuNW5TQjJla3JZQlE1UWpVeWZvdUR0VkdXOHhoYXBqOWRlcTgKZi81YUQyOUJBb0dCQU5LWG94YUNHYnM3Ri84a2xaM09nVWdrVzNqcDVhY0xWbmg0aTVseTVidnJYYVo5VkxoSwpDZGpweTJrVHdpLzQ2Nzg0QTJIS0RXcUJQbk9ZS1VMd1NSaytQQlRWUVpwZ1AzMkFEV2crTGhvZU5PalJNZ3ljCkpMZk5FcmxLZFJvbGVxRVRuc29mbUZXS3Z6UzgwdU1xK1ZMNXJYTUxFYmVwSzVuUGlxbi90TVpuQW9HQkFQR3UKTHh3cTdYdVJabExaNUhWbzkzaEZTMnYrajFpOXVMV21HUzA4YVNEaENJaGtXa01MQ1k5cktubzloSUlhRkNlcQpPTDF6WDE4aWhVQURkdm53TS9YNEZranpQYzBDcGxTME11cWFEOUo2K2NPeVk5eXdSaWp6V2hMbENNT2JucWNzCmFnL1lOQm5aSDBPcW9lYmpuT1c1WUYyMDd6b05kMGdZOHdJT2RTSXhBb0dBRHFqRGo0T0s2ditZRWdpbjZZNUEKYlpjcVR1WnBPQkdQK1Y3YXlObTRxRFlnRk1EUXJ1dG9lQkwrTjloS1FqQ2ZxSFhydGxqc1NpZXBBejdxVUdDTgpsaFpBOUdwTDRNVW1aa1FOcXQzNU01UTZ0cUlwUzd0cXl1aVpqeEJoeW1vbGVTVDJmcmRvVVR3UlIwaUZuWTZXClFISms0b2M0dW9JcUtORExwRDNLaGEwQ2dZRUF0U1NxR01Hd0tEcnQ1OUY3SStsZCt0NXRUbStKUDZsTDVaS3UKTWpLaVZVdDEyc3prdm5WcVgvMmg0K2R5QnhYRzM0ZjlhVG90VktBS0lkVzIrbFRvalVhNlpVa3puQktOV3RXSgppRCthOWxiSUY3OEFqR3Z1MmtpenpZK3ZSdlhBTDJyaHdDaDd2SmY1ai8wM3hsZjV4RkZ5Z2luWVdMbTVHdWZnClZEMUQzREVDZ1lCZ2Jod2JscWI1aXM2ZDYvL2M5Z3RZZlZPVGZxam5WV1JtRUd4djVKVkdCbDZNNU13bjNSNXcKaWdWajBORW0xQmx1SFc3Y0xtYTE4NG44V2VuWkdZTmVnaDhCc0ZCY0ZzWWp1Uk5mSndBMmpFUDVnemZLdk9PSgpNQStXenRvK1lWUnE5VVluVFBTalU3L3NRbjhiaHIyVWJPTWYydE9GbnhQbGQyNUZJdHBsR0E9PQotLS0tLUVORCBSU0EgUFJJVkFURSBLRVktLS0tLQo=\n"
            },
        ] -> (known after apply)
        name           = "main"
        region         = "ams3"
      ~ service_subnet = "10.245.0.0/16" -> (known after apply)
      ~ status         = "running" -> (known after apply)
      - tags           = [] -> null
      ~ updated_at     = "2019-07-06 10:23:03 +0000 UTC" -> (known after apply)
      ~ version        = "1.14.1-do.4" -> "1.14.3-do.0" # forces replacement

      ~ node_pool {
          ~ id         = "e50ee1a6-bcb5-4e3f-8224-d078a8d62731" -> (known after apply)
            name       = "budget-pool"
            node_count = 3
          ~ nodes      = [
              - {
                  - created_at = "2019-07-06 10:15:58 +0000 UTC"
                  - id         = "c50546ac-03e3-4e69-a5de-2fa18e4c7f10"
                  - name       = "budget-pool-oiec"
                  - status     = "running"
                  - updated_at = "2019-07-06 10:23:03 +0000 UTC"
                },
              - {
                  - created_at = "2019-07-06 10:15:58 +0000 UTC"
                  - id         = "c5384ccb-348c-44fc-ae30-e514d0f6ce49"
                  - name       = "budget-pool-oie7"
                  - status     = "running"
                  - updated_at = "2019-07-06 10:23:03 +0000 UTC"
                },
              - {
                  - created_at = "2019-07-06 10:15:58 +0000 UTC"
                  - id         = "a793e527-4e8f-4e9c-b32d-6c222bf6acf3"
                  - name       = "budget-pool-oiem"
                  - status     = "running"
                  - updated_at = "2019-07-06 10:23:03 +0000 UTC"
                },
            ] -> (known after apply)
            size       = "s-1vcpu-2gb"
            tags       = [
                "budget",
            ]
        }
    }

  # helm_release.loki will be created
  + resource "helm_release" "loki" {
      + chart            = "loki/loki"
      + disable_webhooks = false
      + force_update     = false
      + id               = (known after apply)
      + metadata         = (known after apply)
      + name             = "loki"
      + namespace        = "monitoring"
      + recreate_pods    = false
      + repository       = "loki_repo"
      + reuse            = false
      + reuse_values     = false
      + status           = "DEPLOYED"
      + timeout          = 600
      + values           = [
          + "persistence:\n  enabled: true\n  storageClassName: \"\"\n",
        ]
      + verify           = false
      + version          = (known after apply)
      + wait             = true
    }

  # helm_release.promtail will be created
  + resource "helm_release" "promtail" {
      + chart            = "loki/promtail"
      + disable_webhooks = false
      + force_update     = false
      + id               = (known after apply)
      + metadata         = (known after apply)
      + name             = "promtail"
      + namespace        = "monitoring"
      + recreate_pods    = false
      + repository       = "loki_repo"
      + reuse            = false
      + reuse_values     = false
      + status           = "DEPLOYED"
      + timeout          = 600
      + values           = [
          + "loki:\n  serviceName: \"loki\"",
        ]
      + verify           = false
      + version          = (known after apply)
      + wait             = true
    }

Plan: 3 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

